docs/mathematics/single_variable_calculus/KBe21math401retSurfaceAreaOfSphere.tex
% Created 2021-09-12 Sun 22:50
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Albert Huang}
\date{\today}
\title{Circumfrence of a circle and Surface Area of a sphere}
\hypersetup{
 pdfauthor={Albert Huang},
 pdftitle={Circumfrence of a circle and Surface Area of a sphere},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{circumfrence}
\label{sec:orgb1e6c15}
Start with the arc length formula

\[\begin{aligned}
  2 \int_{0}^{a} \sqrt{1+f'^2(x)} dx
  \end{aligned}\]
\(f(x) = \sqrt{a^2-x^2}\) so \(f'(x) = \frac{1}{2\sqrt{a^2-x^2}}(-2x) = -\frac{x}{\sqrt{a^2-x^2}}\)

\[\begin{aligned}
  2 \int_{0}^{a} \sqrt{1+\frac{x^2}{a^2-x^2}} dx = 2 \int_{0}^{a} \sqrt{\frac{a^2}{a^2-x^2}} dx
  \end{aligned}\]

Now we need to use trig substitution. Lets use \(x = a \sin \theta\), with the limit assumptions \(- \frac{\pi}{2} \leq \theta \leq  \frac{\pi}{2}\). Then, \(dx = a \cos  \theta d\theta\)

\[\begin{aligned}
  &= 2 \int \sqrt{\frac{a^2}{a^2 - a^2 \sin  ^2 \theta}} d\theta\\
  &= 2 \int \sqrt{\frac{1}{1 - \sin  ^2 \theta}} d\theta\\
  &= 2 \int \sqrt{\frac{1}{\cos  ^2 \theta}} d\theta\\
  &= 2 \int \sqrt{\sec ^2 \theta} d\theta\\
  &= 2 \int \sec  \theta d\theta\\
  &= 2 \ln  | \sec \theta + \tan  \theta |\\
  \end{aligned}\]

Now for the triangle part! \(\sec \theta = \frac{1}{\cos \theta} = \frac{\sqrt{a^2-x^2}}{a}, \tan \theta = \frac{x}{\sqrt{a^2-x^2}}\)


\[\begin{aligned}
  = 2 \ln  \left\lvert \frac{a}{\sqrt{a^2-x^2}} + \frac{x}{\sqrt{a^2-x^2}} \right\rvert
  \end{aligned}\]

Seems like a lot of dividing by zero

\section{surface area}
\label{sec:org6ee8091}
I don't really understand how we use arclength in the calculation of surface area. I tried just using the circumfrence, but that didn't work with the slicing assumption because the surface curves.
\end{document}
